// c++
//  : C언어의 확장판에 해당하는 언어로 C언어의 기능들을 추가하고 개선한 언어

//   # 추가 및 개선점
//     1. 객체지향(캡슐화, 상속, 다형성, 추상화) 기반 코드 작성 가능
//        -> new / delete 동적할당
//        -> class (클래스 = 표현할 정보의 종류 & 동사적 기능)
//     2. 함수 오버로딩(함수명 같으나 파라미터의 타입이나 총 숫자가 다른 함수) 사용 가능
//     3. defalut parameter를 사용 및 이를 통한 오버로딩 간략화 가능
//     4. 참조와 참조변수 & 추가
//     5. 참조에 의한 호출 (call by reference) 가능
//     6. 코드 중간에 변수 선언 가능 (원래의 C는 불가능함)
//     7. 연산자 재정의가 가능
//     8. 컴파일 방식 변경 
//        -> 소스(c++) - 전처리 - 컴파일 - 어셈블리 - 링킹 -> 기계어

// *.cpp
//  : c++ 파일 확장자, 이 파일에는 'main' 함수가 기본적으로 포함됨


